In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('111.csv')

In [3]:
df.head()

,Age,Profession,Marrital Status,Education,No of Dependents,Personal loan,House Loan,Wife Working,Salary,Wife Salary,Total Salary,Make,Price
0,27,Salaried,Single,Post Graduate,0,Yes,No,No,800000,0,800000,i20,800000
1,35,Salaried,Married,Post Graduate,2,Yes,Yes,Yes,1400000,600000,2000000,Ciaz,1000000
2,45,Business,Married,Graduate,4,Yes,Yes,No,1800000,0,1800000,Duster,1200000
3,41,Business,Married,Post Graduate,3,No,No,Yes,1600000,600000,2200000,City,1200000
4,31,Salaried,Married,Post Graduate,2,Yes,No,Yes,1800000,800000,2600000,SUV,1600000

In [4]:
df['Profession'].unique()

array(['Salaried', 'Business'], dtype=object)

In [5]:
df['Profession'] = df['Profession'].map({'Salaried' : 0 , 'Business' : 1})

In [7]:
df['Marrital Status'].unique()

array(['Single', 'Married'], dtype=object)

In [8]:
df['Marrital Status'] = df['Marrital Status'].map({'Single' : 0 , 'Married' : 1})

In [9]:
df['Education'].unique()

array(['Post Graduate', 'Graduate'], dtype=object)

In [10]:
df['Education'] = df['Education'].map({'Post Graduate' : 0 , 'Graduate' : 1})

In [11]:
df['Personal loan'] = df['Personal loan'].map({'No' : 0 , 'Yes' : 1})

In [13]:
df['House Loan'] = df['House Loan'].map({'No' : 0 , 'Yes' : 1})

In [14]:
df['Wife Working'] = df['Wife Working'].map({'No' : 0 , 'Yes' : 1})

In [16]:
df.head()

,Age,Profession,Marrital Status,Education,No of Dependents,Personal loan,House Loan,Wife Working,Salary,Wife Salary,Total Salary,Make,Price
0,27,0,0,0,0,1,0,0.0,800000,0,800000,i20,800000
1,35,0,1,0,2,1,1,1.0,1400000,600000,2000000,Ciaz,1000000
2,45,1,1,1,4,1,1,0.0,1800000,0,1800000,Duster,1200000
3,41,1,1,0,3,0,0,1.0,1600000,600000,2200000,City,1200000
4,31,0,1,0,2,1,0,1.0,1800000,800000,2600000,SUV,1600000

In [17]:
df.isnull().sum()

Age                 0
Profession          0
Marrital Status     0
Education           0
No of Dependents    0
Personal loan       0
House Loan          0
Wife Working        1
Salary              0
Wife Salary         0
Total Salary        0
Make                0
Price               0
dtype: int64

In [18]:
df = df.dropna()

In [19]:
df.head()

,Age,Profession,Marrital Status,Education,No of Dependents,Personal loan,House Loan,Wife Working,Salary,Wife Salary,Total Salary,Make,Price
0,27,0,0,0,0,1,0,0.0,800000,0,800000,i20,800000
1,35,0,1,0,2,1,1,1.0,1400000,600000,2000000,Ciaz,1000000
2,45,1,1,1,4,1,1,0.0,1800000,0,1800000,Duster,1200000
3,41,1,1,0,3,0,0,1.0,1600000,600000,2200000,City,1200000
4,31,0,1,0,2,1,0,1.0,1800000,800000,2600000,SUV,1600000

In [20]:
df.shape

(98, 13)

In [21]:
df.isnull().sum()

Age                 0
Profession          0
Marrital Status     0
Education           0
No of Dependents    0
Personal loan       0
House Loan          0
Wife Working        0
Salary              0
Wife Salary         0
Total Salary        0
Make                0
Price               0
dtype: int64

In [22]:
df.to_csv('Harsh Priyam-Cleaned-111.csv')